<script lang="ts">

import Accordion from "$ui-kit/Accordion/Accordion.svelte";
</script>

<section class="page-container">
    <h2>Вопросы и ответы</h2>
    <div class="accordion-container">
        <Accordion question="Записываться у вас в медицинском центре дороже, чем в клинике?"
                   answer="Нет, цены на DocPro не отличаются от цен в клиниках.
                    Более того, во многие клиники записаться через СберЗдоровье даже дешевле,
                     чем по телефону медицинского центра. Максимальная скидка до 50%!"/>
        <Accordion question="Как записаться на приём?"
                   answer="Нет, цены на DocPro не отличаются от цен в клиниках.
                    Более того, во многие клиники записаться через СберЗдоровье даже дешевле,
                     чем по телефону медицинского центра. Максимальная скидка до 50%!"/>
        <Accordion question="Сколько стоит услуги медицинского сервиса?"
                   answer="Нет, цены на DocPro не отличаются от цен в клиниках.
                    Более того, во многие клиники записаться через СберЗдоровье даже дешевле,
                     чем по телефону медицинского центра. Максимальная скидка до 50%!"/>
        <Accordion question="Как оплачивается приём врача?"
                   answer="Нет, цены на DocPro не отличаются от цен в клиниках.
                    Более того, во многие клиники записаться через СберЗдоровье даже дешевле,
                     чем по телефону медицинского центра. Максимальная скидка до 50%!"/>
        <Accordion question="Ваш медицинский сервис — клиника?"
                   answer="Нет, цены на DocPro не отличаются от цен в клиниках.
                    Более того, во многие клиники записаться через СберЗдоровье даже дешевле,
                     чем по телефону медицинского центра. Максимальная скидка до 50%!"/>
    </div>
</section>

<style lang="scss">
    .accordion-container {
      margin-top: 64px;

      display: flex;
      flex-direction: column;
      gap: 16px;
    }
</style>