<script lang="ts">

import Accordion from "$ui-kit/Accordion/Accordion.svelte";
</script>

<section class="page-container">
    <h2>Вопросы и ответы</h2>
    <div class="accordion-container">
        <Accordion title="Записываться у вас в медицинском центре дороже, чем в клинике?">
            Нет, цены на DocPro не отличаются от цен в клиниках.
            Более того, во многие клиники записаться через СберЗдоровье даже дешевле,
            чем по телефону медицинского центра. Максимальная скидка до 50%!
        </Accordion>
        <Accordion title="Как записаться на приём?">
            Нет, цены на DocPro не отличаются от цен в клиниках.
            Более того, во многие клиники записаться через СберЗдоровье даже дешевле,
            чем по телефону медицинского центра. Максимальная скидка до 50%!
        </Accordion>
        <Accordion title="Сколько стоит услуги медицинского сервиса?">
            Нет, цены на DocPro не отличаются от цен в клиниках.
            Более того, во многие клиники записаться через СберЗдоровье даже дешевле,
            чем по телефону медицинского центра. Максимальная скидка до 50%!
        </Accordion>
        <Accordion title="Как оплачивается приём врача?">
            Нет, цены на DocPro не отличаются от цен в клиниках.
            Более того, во многие клиники записаться через СберЗдоровье даже дешевле,
            чем по телефону медицинского центра. Максимальная скидка до 50%!
        </Accordion>
        <Accordion title="Ваш медицинский сервис — клиника?">
            Нет, цены на DocPro не отличаются от цен в клиниках.
            Более того, во многие клиники записаться через СберЗдоровье даже дешевле,
            чем по телефону медицинского центра. Максимальная скидка до 50%!
        </Accordion>

    </div>
</section>

<style lang="scss">
    .accordion-container {
      margin-top: 64px;

      display: flex;
      flex-direction: column;
      gap: 16px;
    }
</style>