<script>
    import {page} from "$app/state"

    import Breadcrumbs from "$ui-kit/Breadcrumbs/Breadcrumbs.svelte"
    import {getHTMLFormattedTime} from "$lib/helpers.js"

    let {
        data
    } = $props()

    const {
        date,
        title,
        thumbnail
    } = data

    const list = [
        {
            title: 'Главная',
            href: '/',
        },
        {
            title: 'Библиотека',
            href: '/library',
        },
        {
            title: 'Советы',
            href: '/library/advices/all/1',
        },
        {
            title,
            href: '',
        }
    ]
</script>

<svelte:head>
  <title>{title}</title>
</svelte:head>
<div class="breadcrumbs page-container">
  <Breadcrumbs {list}/>
</div>

<main class="page-container">
  <div class="publish_time">
    <span>Дата публикации</span>
    <time datetime={getHTMLFormattedTime(date)}>{date.toLocaleDateString('ru-RU')}</time>
  </div>

  <h1>{title}</h1>

  <img class="thumbnail" src={thumbnail} alt="">

  <div class="main-wrapper">
    <div class="navigation">
      <a class:active={page.url.href.includes('#intro')} href="#intro">Введение</a>
      <a class:active={page.url.href.includes('#from')} href="#from">Откуда берётся холестерин, и когда диета не помогает?</a>
      <a class:active={page.url.href.includes('#how')} href="#how">Как его потратить?</a>
      <a class:active={page.url.href.includes('#analysis')} href="#analysis">Какой анализ на холестерин нужно сдавать?</a>
      <a class:active={page.url.href.includes('#normal_1')} href="#normal_1">Нормы холестерина в крови</a>
      <a class:active={page.url.href.includes('#normal_2')} href="#normal_2">Как снизить холестерин без лекарств?</a>
    </div>

    <div>
      <h2 id="intro" class="title-1">Введение</h2>
      <p class="body-text-2">
        Известно, что при атеросклерозе в стенках сосудов образуются утолщения, которые содержат большое количество
        холестерина. Просвет сосуда суживается, но кровоток ухудшается медленно. Организм обычно успевает вырастить
        новые артерии в обход повреждённых.
      </p>
      <p class="body-text-2">
        Хуже, когда атеросклеротические бляшки воспаляются и изъязвляются. В месте повреждения формируется кровяной
        сгусток, который быстро перекрывает ток крови, что приводит к развитию инсульта и инфаркта.
      </p>
      <p class="body-text-2">
        Давайте разберёмся, откуда холестерин берётся, куда девается, как расшифровать анализы и нормализовать
        показатели крови естественным путём.
      </p>

      <h2 id="from" class="title-1">Откуда берётся холестерин, и когда диета не помогает?</h2>
      <p class="body-text-2">
        По данным фундаментальной науки, большую часть холестерина — 70–90% — ежедневно синтезирует печень, и только
        малую часть — 10–30% — человек добирает из продуктов питания. Отсюда появился миф, что даже если совсем ничего
        не есть, сильно холестерин не снизишь.
      </p>
      <p class="body-text-2">
        На самом деле, процентное соотношение внутреннего холестерина к «пищевому» рассчитано учёными исходя из
        биологической потребности организма, а не из того, что мы реально кушаем. Количество холестерина в обычном меню
        превышает потребность, поэтому пропорция нарушается. Чем больше холестерина вы съели, тем больше его всосётся в
        кровь.
      </p>
      <p class="body-text-2">
        Организм пытается удержать свою норму, снижая активность биосинтеза в печени. Однако механизм этот значительно
        слабее, чем природная тяга человека к жирному и вкусному. Со временем неправильное питание приводит к накоплению
        лишнего холестерина. В этом случае диета — разумный и эффективный способ улучшить показатели крови.
      </p>
      <p class="body-text-2">
        Однако у некоторых — причина высокого холестерина не питание, а нарушенный обмен веществ либо генетически
        предопределённые особенности работы печени, которая вырабатывает холестерина больше, чем положено.
      </p>

      <h2 id="how" class="title-1">Как его потратить?</h2>
      <p class="body-text-2">
        Около 80% всего холестерина, который есть в организме, используется для переваривания пищи, так как входит в
        состав жёлчи. Жёлчь образуется в печени, затем собирается в жёлчный пузырь и после еды выбрасывается в кишечник
        в составе пищеварительного сока.
      </p>
      <p class="body-text-2">
        Приблизительно половина жёлчи всасывается из кишечника вместе с пищей и возвращается в печень на переработку.
        Другая половина — удаляется с калом. Так организм ежедневно избавляется от приличного количества холестерина.
      </p>

      <p class="body-text-2">
        <i>Уровень холестерина в крови растёт, если жёлчь застаивается в печени или жёлчном пузыре. Так бывает у тех,
          кто сидит на жёстких диетах, нерегулярно питается, а также при ожирении, алкоголизме, гепатите, сахарном
          диабете.</i>
      </p>

      <p class="body-text-2">
        20% содержащегося в организме холестерина идёт на синтез половых гормонов, гормонов надпочечников и витамина Д,
        а также на строительство новых и ремонт старых клеток тела. Холестерин активно расходуется в период усиленного
        роста или восстановления после травм и операций.
      </p>

      <p class="body-text-2">
        <i>Уровень холестерина в крови уменьшается, если вы ведёте активный образ жизни. Для восстановления мышечных
          волокон после физических нагрузок, а также для наращивания новой мышечной массы требуется большое количество
          холестерина.</i>
      </p>

      <p class="body-text-2">
        Если холестерина оказывается больше, чем нужно в данный момент, он откладывается про запас во всех клетках тела.
        Насытившись холестерином, клетки блокируют для него входные ворота — рецепторы на своих мембранах. Тогда
        неизрасходованный холестерин долго плавает в крови и скапливается местами в сосудистой стенке. Это — один из
        возможных механизмов образования атеросклеротических бляшек. Есть предположение, что холестерин откладывается в
        тех местах сосудистой стенки, которые требуют ремонта.
      </p>

      <p class="body-text-2"><i>Артериальная гипертензия и курение сопровождаются резкими колебаниями диаметра сосудов,
        что вызывает микротравмы их внутренней поверхности. Ещё одно заболевание, повреждающее сосуды, — сахарный
        диабет. Все три фактора значительно ускоряют развитие атеросклероза и связаны с высокой смертностью от инсульта
        и инфаркта.</i></p>

      <h2 id="analysis" class="title-1">Какой анализ на холестерин нужно сдавать?</h2>

      <p class="body-text-2">
        Связь между атеросклерозом и холестерином доказана, но до сих пор остаётся вопрос: повышенный холестерин —
        причина болезни или только сопутствующий симптом? На свете немало долгожителей с высоким холестерином, также как
        «сердечников» с нормальными анализами. Учёные все больше склоняются к мысли, что между холестерином и фатальным
        проявлением атеросклероза стоит какой-то неизвестный пока фактор. Именно он определяет: быть болезни или нет.
        Пока эта загадка не разгадана, у нас есть только один анализ — тест на уровень холестерина в крови — как
        показатель здоровья сосудов.
      </p>
      <p class="body-text-2">
        По-хорошему, знать свой холестерин полезно каждому взрослому человеку. Для этого нужно сдать кровь из вены. Если
        хотите получить точные результаты, нужно идти в лабораторию утром, после 12 часов голодания. Уровень холестерина
        немного выше зимой, чем летом. Кроме того, на результаты может повлиять интенсивная физическая нагрузка или
        резкие изменения в питании накануне исследования. Холестерин определяют разными способами, что существенно
        отражается на результатах. Поэтому при повторной диагностике старайтесь пользоваться услугами одной и той же
        лаборатории.
      </p>

      <h3 class="title-3">Анализ на общий холестерин (ОХ, Cholesterol total)</h3>
      <p class="body-text-2">Липопротеиды низкой плотности — разносят холестерин из печени всем нуждающимся клеткам
        организма. Несмотря на важную биологическую роль, именно этот класс липопротеидов называют «плохим»,
        так как ЛПНП могут откладываться в виде бляшек в сосудах.</p>
      <p class="body-text-2">Стандартная липидограмма (липидный профиль) предполагает определение количество холестерина
        в составе разных транспортных молекул — липопротеидов высокой и низкой плотности. Этот анализ позволяет выявить
        дисбаланс «плохого» и «хорошего» холестерина.</p>

      <h3 class="title-3">ЛПНП (LDL)</h3>
      <p class="body-text-2">Липопротеиды низкой плотности — разносят холестерин из печени всем нуждающимся клеткам
        организма. Несмотря на важную биологическую роль, именно этот класс липопротеидов называют «плохим»,
        так как ЛПНП могут откладываться в виде бляшек в сосудах.</p>

      <h3 class="title-3">ЛПВП (HDL)</h3>
      <p class="body-text-2">Липопротеиды высокой плотности — забирают лишний холестерин у клеток и возвращают
        его в печень на переработку. Возможно, такой механизм удаления излишков работает и в сосудах, поэтому ЛПВП
        принято считать «хорошими». Однако последние годы защитная роль ЛПВП ставиться под сомнение.</p>
      <p class="body-text-2">
        По имеющимся представлениям «плохого» холестерина должно быть больше, чем «хорошего», но не более,
        чем в 3,5 раза. Если соотношение нарушается или увеличивается количество общего холестерина, возрастает риск
        атеросклероза. Такую закономерность выявили в ходе клинических исследований. Фундаментальная наука пока не может
        точно объяснить, как именно это работает.
      </p>
      <p class="body-text-2">
        Для диагностики обмена холестерина существуют и другие тесты: определение аполипопротеина А-1, аполипопротеина
        В, липопротеина (a). Возможно в будущем, эти анализы полностью заменят традиционные. А пока для обычного
        человека они являются избыточными и представляют, скорее, научный интерес. О том, как избежать ненужных
        обследований
      </p>

      <h2 id="normal_1" class="title-1">Нормы холестерина в крови</h2>
      <p class="body-text-2">Странно звучит, но, согласно последним рекомендациям, нормы холестерина в крови
        не существует. Поэтому сам по себе анализ крови на холестерин, без учёта других показателей здоровья, не имеет
        смысла. Численный результат анализа нужен для того, чтобы подставить его в специальные таблицы и получить
        величину сердечно-сосудистого риска — то есть вероятность тяжело заболеть в ближайшие 10 лет. Кроме уровня
        холестерина прогноз зависит от возраста, пола, курения и целого ряда заболеваний. В каждой группе будет свой
        риск. Поэтому трактовать анализ на холестерин должен, по идее, врач. В жизни, к сожалению, не всегда удаётся
        вовремя получить консультацию специалиста.</p>

      <h3 class="title-3">Упрощённо можно сказать, что:</h3>
      <ul>
        <li>уровень ОХ 3,8–5,2 ммоль/л — это хорошо,</li>
        <li>5,2–6,2 ммоль/л — умеренно повышенные цифры,</li>
        <li>более 6,2–7 ммоль/л — высокий холестерин.</li>
      </ul>
      
      <p class="body-text-2">Если холестерин больше 5,2–6 ммоль/л, желательно обратиться к врачу общей практики или кардиологу. Скорее всего, придётся сделать липидограмму, а потом решать: нужно ли снижать холестерин и каким способом это делать?</p>
      
      <h2 id="normal_2" class="title-1">Как снизить холестерин без лекарств?</h2>

      <p class="body-text-2">
        Холестерин содержится в любой животной пище: мясе, птице, рыбе, морепродуктах, яйцах, сыре и «молочке».
        Чем жирнее продукт, тем больше в нем холестерина. Исключением является говядина, так как при меньшей жирности
        она содержит на 20–30% больше холестерина, чем свинина.
      </p>
      <p class="body-text-2">
        В растительных продуктах, в том числе подсолнечном масле, соевых сливках и орехах, холестерина нет совсем.
        Но это не значит, что растительные жиры можно есть без ограничений. Дело в том, что любые жиры, которые
        поступают с пищей, стимулируют выработку холестерина в печени. Даже у вегетарианцев может зашкаливать
        холестерин.
      </p>
      <p class="body-text-2">
        Поэтому главная диетическая рекомендация: ограничить жирное в рационе, при этом часть животных жиров заменить
        на растительные.
      </p>
      <p class="body-text-2">
        По поводу того, какие жиры полезнее, а какие — вреднее, ходит много споров. Считается доказанным,
        что употребление насыщенной пальмитиновой жирной кислоты существенно повышает уровень ЛПНП. Помимо животных
        продуктов, пальмитиновая кислота в большом количестве содержится в пальмовом масле, а это — частый компонент
        кондитерских изделий, спреда, маргарина и молокосодержащих продуктов (в том числе недорогого мороженого).
        Как отличить молоко от не молока, можно прочитать здесь.
      </p>
      <p class="body-text-2">
        Второй способ снизить количество холестерина в крови — употреблять больше клетчатки — это сложные углеводы,
        которые почти не перевариваются в кишечнике. Они впитывают в себя некоторое количество жёлчи, жира и холестерина
        из пищи, таким образом, помогают организму избавляться от излишков естественным путём. Такими свойствами
        обладают, например, овсяные хлопья. Их полезно добавлять в фарш, использовать для выпечки. Богаты пектинами
        и клетчаткой фрукты и овощи, а также соки с мякотью.
      </p>
      <p class="body-text-2">
        Доказано, что продукты, содержащие фитостеролы: облепиховое, соевое, кукурузное, подсолнечное масла, семена
        подсолнечника, кунжута, фисташки, пророщенная пшеница, - помогают понизить в крови уровень «плохого»
        холестерина.
      </p>
      <p class="body-text-2">
        Если у вас избыточная масса тела, то для нормализации уровня холестерина в крови иногда достаточно просто
        похудеть. А о важной роли регулярной физической нагрузки мы уже говорили в начале статьи.
      </p>
      <p class="body-text-2">
        В большинстве случаев, изменение образа жизни и диеты решает проблему холестерина без медикаментозной помощи.
        Принимать лекарства имеет смысл только по назначению врача, если понизить холестерин другими способами в течение
        2–3 месяцев не удалось.
      </p>
    </div>
  </div>
</main>

<style lang="scss">
  @use "sass:map";
  @use "$ui-kit/env";

  :global {
    :root {
      scroll-behavior: smooth;
    }
  }

  .publish_time {
    font-size: 14px;
    font-weight: 700;

    letter-spacing: .2em;
    text-transform: uppercase;

    @media (max-width: map.get(env.$screen-size, tablet)) {
      font-size: 12px;
    }
  }

  h1 {
    font-size: 48px;
    margin-top: 8px;

    @media (max-width: map.get(env.$screen-size, netbook)) {
      font-size: 32px;
    }

    @media (max-width: map.get(env.$screen-size, tablet)) {
      font-size: 24px;
    }
  }

  .thumbnail {
    width: 100%;

    aspect-ratio: 1600 / 650;
    object-fit: cover;
    margin: 64px 0;

    @media (max-width: map.get(env.$screen-size, netbook)) {
      aspect-ratio: 928 / 410;
    }

    @media (max-width: map.get(env.$screen-size, tablet)) {
      aspect-ratio: 688 / 310;
      margin: 32px 0;
    }

    @media (max-width: map.get(env.$screen-size, mobile)) {
      aspect-ratio: 329 / 210;
    }
  }

  .breadcrumbs {
    margin-bottom: 32px;
  }

  .main-wrapper {
    display: grid;
    grid-template-columns: 3fr 9fr;
    gap: 32px;

    @media (max-width: map.get(env.$screen-size, tablet)) {
      grid-template-columns: 1fr;
    }
  }

  .navigation {
    @media (min-width: (map.get(env.$screen-size, tablet) + 1px)) {
      position: sticky;
      top: 32px;
    }

    display: flex;
    flex-direction: column;
    gap: 8px;
    padding: 32px;

    height: fit-content;

    font-weight: 600;

    border: 1px solid rgba(map.get(env.$color, primary), .1);
    border-radius: 12px;

    a {
      width: fit-content;

      border-bottom: 2px solid transparent;

      opacity: .5;
      color: #000;

      transition: opacity 300ms, border-color 300ms;
    }

    a.active {
      opacity: 1;
      border-color: map.get(env.$color, primary);
    }
  }

  ul {
    margin: 8px 0;
  }

  li {
    font-family: Helvetica, sans-serif;
  }

  * + h3 {
    margin-top: 16px;
  }

  * + h2 {
    margin-top: 32px;
  }

  h2 + p {
    margin-top: 32px;
  }

  p + p {
    margin-top: 16px;
  }

  p {
    white-space: pre-line;
  }

  i {
    font-weight: 550;
    color: #000;
  }
</style>